Хи-тестове:

Пак имаме хипотези, но този път те са за това как са разпределени данните.
Например: Н0: Данните са нормално разпределени
          Н1: Данните не са нормално разпределени
Х - случайна величина
Н0: Fx = F0
H1: Fx != F0

Pi = P(X <- Di)
n.Pi - колко би трябвало да са в i-тия интервал
Кi - брой наблюдения попаднали в i-тия интервал

t = sum(from i=1 to r) ((Ki - n.Pi)^2) /n.Pi 
t <- Hi^2(r - s - 1)
r - брой интервали
s - брой параметри, които оценяваме от данните

За да отхвърлим хипотезата, t трябва да е по-голяма от някаква константа.


X, Y
H0: X и Y са независими
H1: X и Y са независими

X и Y са независими <=> P(X = xj, Y = yi) = P(X = xj).P(Y = yi)
t = (1/c) * sum(i до k,j до m)(nij/N - ni.nj/N.N)^2
