H0: Слагането на колан не влияе при катастрофа
H1: Слагането на колан влияе при катастрофа

x = scan()
1: 12813 647 359 42
5: 65963 4000 2642 303
9: 
Read 8 items
> m = matrix(x, nrow = 2, ncol = 4)
> m
      [,1] [,2]  [,3] [,4]
[1,] 12813  359 65963 2642
[2,]   647   42  4000  303
> m = t(matrix(x, nrow = 4, ncol = 2))
> m
      [,1] [,2] [,3] [,4]
[1,] 12813  647  359   42
[2,] 65963 4000 2642  303
> chisq.test(m)

	Pearson's Chi-squared test

data:  m
X-squared = 59.224, df = 3, p-value = 8.61e-13 => H1
