H0: Независими са качеството на стоката и денят в който е произведен
Н1: Зависими са качеството на стоката и денят в който е произведен

 x = scan()
1: 44 74 79 72 31
6: 14 25 27 24 10
11: 15 20 20 23 9
16: 3 5 5 0 0
21: 
Read 20 items
> m = matrix(x, nrow = 4, byrow = TRUE)
> m
     [,1] [,2] [,3] [,4] [,5]
[1,]   44   74   79   72   31
[2,]   14   25   27   24   10
[3,]   15   20   20   23    9
[4,]    3    5    5    0    0
> chisq.test(m)

	Pearson's Chi-squared test

data:  m
X-squared = 7.8308, df = 12, p-value = 0.7982 => Н0

Можем 4-тия ред да го добавим към третия. Тогава няма warning и p-value = 0.99 => H0
