Дисперсионен анализ

X11 ... Xn(1)1   - средна стойност mu1
X12 ... Xn(2)2   - средна стойност mu2
.
.
.
x1p ... Xnp      - средна стойност mup

ЕXij = muj + Epsilon(i,j)

Epsilon(i,j) <- N(0, sigma^2)
Хипотеза: mu1 = mu2 = ... = mup
Алтернатива: Има поне едно различно

SSwithin = sum(j = 1 to p)(sum(i = 1 to nj)(xij - xj(черта))^2))
xj(черта) = (sum(i = n to ni)(xij)) / nj - средно аритметично на групата
х(черта) - общото средно аритметично

SSbetween = sum(j = 1 to p)( (xj(черта) - х(черта))^2*nj) ~= 0

SStot = sum(j)(sum(i)( (xij - x(черта))^2)
SStot = SSwithing + SSbetween

f - статистика, която ползваме за оценка на хипотезата
f = (SSbetween / (p-1)) / (SSwithin / (n - p)) <- F(p-1, n-p) - разпределение на Фишър??

Ако SSbetween / (p-1) е малко => групите са близо една до друга, ако е голямо => групите са отдалечени. Хипотезата е приета, когато
групите са близо една до друга
w = {f > q} - критична област
